print("                                                     መልእክትን_ማመስጠር")
def ማመስጠር():
    ቃላት="qwertyuiopasdfghjklzxcvbnm"
    ኢንፑት=input("መልእክቶን ያስገቡ: ")
    ቁልፍ=4
    የተቀየረው_መልእክት=""

    for ፊደል in ኢንፑት:
        if ፊደል in ቃላት:
            ቦታ=ቃላት.find(ፊደል)
            #print(ቦታ)
            አዲስ_ቦታ=(ቦታ+ቁልፍ) % len(ቃላት)
            #print(አዲስ_ቦታ)
            ቃል=ቃላት[አዲስ_ቦታ]
            #print(ቃል)
            የተቀየረው_መልእክት+=ቃል
        else:
            የተቀየረው_መልእክት+=ፊደል
    print("የተቀየረው_መልእክት ፤ "+የተቀየረው_መልእክት+" ፤ ነው")

    print("                                                      መልእክትን_መፍታት")


def ሚስጥሩን_መፍታት():
    ቃላት="qwertyuiopasdfghjklzxcvbnm"
    ኢንፑት=input("የተሰጦትን መልእክት ያስገቡ: ")
    ቁልፍ=-4
    የተቀየረው_መልእክት=""

    for ፊደል in ኢንፑት:
        if ፊደል in ቃላት:
            ቦታ=ቃላት.find(ፊደል)
            #print(ቦታ)
            አዲስ_ቦታ=(ቦታ+ቁልፍ) % len(ቃላት)
            #print(አዲስ_ቦታ)
            ቃል=ቃላት[አዲስ_ቦታ]
            #print(ቃል)
            የተቀየረው_መልእክት+=ቃል
        else:
            የተቀየረው_መልእክት+=ፊደል
    print("ትክክለኛው_መልእክት ፤ "+የተቀየረው_መልእክት+" ፤ ነው")


ማመስጠር()
ሚስጥሩን_መፍታት()